<?php 

return [
    'languages' => [

        'EN' => [
            'name' =>  'Английский',
            'alias' =>  'en',
            'regex' =>  '/^[a-zA-Z1-9,. \'!?\:;()\-\s]+$/',
            'max' =>  80,

        ],

        'DE' => [
            'name' =>  'Немецкий',
            'alias' =>  'de',
            'regex' =>  '/^[a-zA-Z1-9,. \'!?\:;()\-\s]+$/',
            'max' =>  80,
        ],

        'RU' => [
            'name' =>  'Русский',
            'alias' =>  'ru',
            'regex' =>  '/^[А-Яа-яёЁ0-9., :;?\-!\s]+$/u',
            'max' =>  80,
        ],

    ],
];



?>